Gregification/BeeMS/VT_MSPM0G3507_A/src/Core/system.cpp
        /*--- SPI config -----------------*/

        DL_SPI_ClockConfig clk_config = {
                 .clockSel      = DL_SPI_CLOCK::DL_SPI_CLOCK_BUSCLK, // 40e6
                 .divideRatio   = DL_SPI_CLOCK_DIVIDE_RATIO::DL_SPI_CLOCK_DIVIDE_RATIO_1,
            };
        DL_SPI_setClockConfig(spi0.reg, &clk_config);
        DL_SPI_Config config = {
                .mode           = DL_SPI_MODE::DL_SPI_MODE_CONTROLLER,
                .frameFormat    = DL_SPI_FRAME_FORMAT::DL_SPI_FRAME_FORMAT_MOTO4_POL0_PHA0,
                .parity         = DL_SPI_PARITY::DL_SPI_PARITY_NONE,
                .dataSize       = DL_SPI_DATA_SIZE::DL_SPI_DATA_SIZE_8,
                .bitOrder       = DL_SPI_BIT_ORDER::DL_SPI_BIT_ORDER_MSB_FIRST,
                .chipSelectPin  = DL_SPI_CHIP_SELECT::DL_SPI_CHIP_SELECT_NONE,
            };
        DL_SPI_init(spi0.reg, &config);
        DL_SPI_setFIFOThreshold(spi0.reg, DL_SPI_RX_FIFO_LEVEL::DL_SPI_RX_FIFO_LEVEL_1_2_FULL, DL_SPI_TX_FIFO_LEVEL::DL_SPI_TX_FIFO_LEVEL_1_2_EMPTY);
        DL_SPI_disablePacking(spi0.reg);
        spi0.setSCLKTarget(125e3);
        DL_SPI_enable(spi0.reg);

        spi0._trxBuffer.rx_i = -1;

        NVIC_EnableIRQ(SPI0_INT_IRQn);
        DL_SPI_enableInterrupt(System::spi0.reg,
                  DL_SPI_INTERRUPT_RX
                | DL_SPI_INTERRUPT_TX
                | DL_SPI_INTERRUPT_IDLE
            );
    }
    #endif

    #ifdef PROJECT_ENABLE_MCAN0
    {
        DL_MCAN_enableModuleClock(CANFD0);

        {
            static_assert(System::CLK::CANCLK == 80e6, "CAN peripheral clock misconfigured"); // adjust the dividers so that the clock is either 20MHz,40MHz, or 80MHz
            static DL_MCAN_ClockConfig clkConfig = {
               .clockSel= DL_MCAN_FCLK::DL_MCAN_FCLK_SYSPLLCLK1,
               .divider = DL_MCAN_FCLK_DIV::DL_MCAN_FCLK_DIV_1,
            };
            DL_MCAN_setClockConfig(CANFD0, &clkConfig);

        }

        // have no idea if this is required for the setup
        DL_MCAN_RevisionId revId;
        /* Get MCANSS Revision ID. */
        DL_MCAN_getRevisionId(CANFD0, &revId);

        /* Wait for Memory initialization to be completed. */
        while(false == DL_MCAN_isMemInitDone(CANFD0))
            ;

        /* Put MCAN in SW initialization mode. */
        DL_MCAN_setOpMode(CANFD0, DL_MCAN_OPERATION_MODE_SW_INIT);
        while(DL_MCAN_OPERATION_MODE_SW_INIT != DL_MCAN_getOpMode(CANFD0))
            ;

        { /* Initialize MCAN module. */
            constexpr DL_MCAN_InitParams initparam = {
                  /* Initialize MCAN Init parameters.    */
                  .fdMode            = true,    // CAN FD mode?
                  .brsEnable         = true,    // enable bit rate switching?
                  .txpEnable         = true,    // pause for 2 bit times after successful transmission?
                  .efbi              = false,   // edge filtering? 2 consecutive Tq to accept sync
                  .pxhddisable       = false,   // do not Tx error frame on protocol error?
                  .darEnable         = true,    // auto retransmission of failed frames?
                  .wkupReqEnable     = false,   // enable wake up request?
                  .autoWkupEnable    = false,   // enable auto-wakeup?
                  .emulationEnable   = false,
                  .wdcPreload        = 255,     // start value of message ram WDT

                  /* Transmitter Delay Compensation parameters. tm.26.4.6/1439 */
                  .tdcEnable         = false,   // transmitter delay compensation, oscilloscope the time diff between edges of TX->RX signals
                  .tdcConfig.tdcf    = 10,      // filter length
                  .tdcConfig.tdco    = 6,       // filter offset
                };
            DL_MCAN_init(CANFD0, &initparam);
        }

        { /* Configure MCAN module. */
            constexpr DL_MCAN_ConfigParams config = {
                    .monEnable         = false,     // bus monitoring mode
                    .asmEnable         = false,     // restricted operation mode
                    .tsPrescalar       = 15,        // timestamp counter prescalar
                    .tsSelect          = 0,         // timestamp source selection
                    .timeoutSelect     = DL_MCAN_TIMEOUT_SELECT_CONT, // timeout source select
                    .timeoutPreload    = 65535,     // load value of timeout counter
                    .timeoutCntEnable  = false,     // timeout counter enable
                    .filterConfig.rrfe = 0,      // reject remote frames extended
                    .filterConfig.rrfs = 0,      // reject remote frames standard
                    .filterConfig.anfe = 0,         // accept non-matching frames extended
                    .filterConfig.anfs = 0,         // accept non-matching frames standard
                };
            DL_MCAN_config(CANFD0, &config);
        }

        { /* Configure Bit timings. */
            constexpr DL_MCAN_BitTimingParams   bitTimeingParams = {
                    .nomRatePrescalar   = 4,    /* Arbitration Baud Rate Pre-scaler. */
                    .nomTimeSeg1        = 26,   /* Arbitration Time segment before sample point. */
                    .nomTimeSeg2        = 3,    /* Arbitration Time segment after sample point. */
                    .nomSynchJumpWidth  = 3,    /* Arbitration (Re)Synchronization Jump Width Range. */
                    .dataRatePrescalar  = 4,    /* Data Baud Rate Pre-scaler. */
                    .dataTimeSeg1       = 26,    /* Data Time segment before sample point. */
                    .dataTimeSeg2       = 3,    /* Data Time segment after sample point. */
                    .dataSynchJumpWidth = 3,    /* Data (Re)Synchronization Jump Width.   */
                };
            DL_MCAN_setBitTime(CANFD0, &bitTimeingParams);
        }

        { /* Configure Message RAM Sections */
            constexpr DL_MCAN_MsgRAMConfigParams  ramConfig = {
                    .flssa                = 0,  /* Standard ID Filter List Start Address. */
                    .lss                  = 2,  /* List Size: Standard ID. */
                    .flesa                = 0,  /* Extended ID Filter List Start Address. */
                    .lse                  = 0,  /* List Size: Extended ID. */
                    .txStartAddr          = 148, /* Tx Buffers Start Address. */
                    .txBufNum             = 2,  /* Number of Dedicated Transmit Buffers. */
                    .txFIFOSize           = 19, /* Tx Buffer Element Size. */
                    .txBufMode            = 0,
                    .txBufElemSize        = DL_MCAN_ELEM_SIZE_64BYTES,
                    .txEventFIFOStartAddr = 164,/* Tx Event FIFO Start Address. */
                    .txEventFIFOSize      = 2,  /* Event FIFO Size. */
                    .txEventFIFOWaterMark = 0,  /* Level for Tx Event FIFO watermark interrupt. */
                    .rxFIFO0startAddr     = 172,  /* Rx FIFO0 Start Address. */
                    .rxFIFO0size          = 3,  /* Number of Rx FIFO elements. */
                    .rxFIFO0waterMark     = 0,  /* Rx FIFO0 Watermark. */
                    .rxFIFO0OpMode        = 0,
                    .rxFIFO1startAddr     = 192,  /* Rx FIFO1 Start Address. */
                    .rxFIFO1size          = 2,  /* Number of Rx FIFO elements. */
                    .rxFIFO1waterMark     = 3,  /* Level for Rx FIFO 1 watermark interrupt. */
                    .rxFIFO1OpMode        = 0,  /* FIFO blocking mode. */
                    .rxBufStartAddr       = 208,  /* Rx Buffer Start Address. */
                    .rxBufElemSize        = DL_MCAN_ELEM_SIZE_8BYTES,  /* Rx Buffer Element Size. */
                    .rxFIFO0ElemSize      = DL_MCAN_ELEM_SIZE_8BYTES,  /* Rx FIFO0 Element Size. */
                    .rxFIFO1ElemSize      = DL_MCAN_ELEM_SIZE_8BYTES,  /* Rx FIFO1 Element Size. */
                };
            DL_MCAN_msgRAMConfig(CANFD0, &ramConfig);
        }

//        {
//            constexpr DL_MCAN_StdMsgIDFilterElement filtere = {
//                   .sfid2   = 3 << 18,
//                   .sfid1   = 3,
//                   .sfec    = 0b001,
//                   .sft     = 0b01,
//                };
//            DL_MCAN_addStdMsgIDFilter(CANFD0, 0, &filtere);
//        }

        /* Set Extended ID Mask. */
        // is ANDed with 29b message id of frame
        DL_MCAN_setExtIDAndMask(CANFD0, 0x1FFFFFFF);

        /* Take MCAN out of the SW initialization mode */
        DL_MCAN_setOpMode(CANFD0, DL_MCAN_OPERATION_MODE_NORMAL);
        while(DL_MCAN_OPERATION_MODE_NORMAL != DL_MCAN_getOpMode(CANFD0))
            ;
    }
    #endif

