Gregification/BeeMS/VT_MSPM0G3507_A/src/Core/system.cpp
}

inline bool System::Lockable::takeResource(TickType_t timeout) {
    return pdTRUE == xSemaphoreTakeRecursive(semph, timeout);
}

inline void System::Lockable::releaseResource() {
    xSemaphoreGiveRecursive(semph);
}

void System::UART::UART::setBaudTarget(uint32_t target_baud, uint32_t clk) {
    // i remember seeing there was some function in DL that did exactly the same thing.
    // I cant find it anymore :(

    //TODO pg1351 https://www.ti.com/lit/ug/slau846b/slau846b.pdf?ts=1749245238762&ref_url=https%253A%252F%252Fwww.ti.com%252Fproduct%252FMSPM0G3507
    // 115200 baud
    uint32_t nume = clk;
    uint32_t deno = target_baud;

    switch(DL_UART_getOversampling(reg)){
        default:            break; // should never reach this, your cooked, maybe screwed up the initialization or something
        case DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_3X:
            deno *= 3;      break;
        case DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_8X:
            deno *= 8;      break;
        case DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_16X:
            deno *= 16;     break;
    };

    int32_t integer, fractional;
    integer = nume / deno;
    fractional = ( (nume * 64) + 1 ) / deno;

    DL_UART_setBaudRateDivisor(reg, integer, fractional);

    return;
}

/**
 * usage example
 *      System::UART::partialInit(UART0);
 *      DL_GPIO_initPeripheralOutputFunction(IOMUX_PINCM21, IOMUX_PINCM21_PF_UART0_TX); // PA10
 *      DL_GPIO_initPeripheralOutputFunction(IOMUX_PINCM22, IOMUX_PINCM22_PF_UART0_RX); // PA11
 *
 *      setBaudTarget(UART0, 115200);
 *      DL_UART_enable(UART0);
 */
void System::UART::UART::partialInit() {
    DL_UART_disable(reg);
    DL_UART_disablePower(reg);
    DL_UART_reset(reg);
    DL_UART_enablePower(reg);

    constexpr DL_UART_ClockConfig config_uart_clk = {
            .clockSel   = DL_UART_CLOCK::DL_UART_CLOCK_MFCLK,
            .divideRatio= DL_UART_CLOCK_DIVIDE_RATIO::DL_UART_CLOCK_DIVIDE_RATIO_1,
        };
    constexpr DL_UART_Config config_uart = {
            .mode        = DL_UART_MODE::DL_UART_MAIN_MODE_NORMAL,
            .direction   = DL_UART_DIRECTION::DL_UART_MAIN_DIRECTION_TX_RX,
            .flowControl = DL_UART_FLOW_CONTROL::DL_UART_MAIN_FLOW_CONTROL_NONE,
            .parity      = DL_UART_PARITY::DL_UART_MAIN_PARITY_NONE,
            .wordLength  = DL_UART_WORD_LENGTH::DL_UART_MAIN_WORD_LENGTH_8_BITS,
            .stopBits    = DL_UART_STOP_BITS::DL_UART_MAIN_STOP_BITS_ONE
        };
    DL_UART_setClockConfig(reg, &config_uart_clk);
    DL_UART_init(reg, &config_uart);

    DL_UART_setOversampling(reg, DL_UART_OVERSAMPLING_RATE::DL_UART_OVERSAMPLING_RATE_16X);

    DL_UART_enableFIFOs(reg); // not required but very useful
}

void System::FailHard(const char *str) {
    taskDISABLE_INTERRUPTS();

    static uint32_t count = 0;
    while(1) {
        System::uart_ui.nputs(ARRANDN(NEWLINE CLIERROR "fatal error "));
        System::uart_ui.putu32d(count);
        System::uart_ui.nputs(ARRANDN(" : " CLIRESET));
        System::uart_ui.nputs(str, MAX_STR_ERROR_LEN);

        delay_cycles(System::CLK::CPUCLK * 10);
        count++;
    }

    // this will effectively stun lock the device and make the debugger throw a fit
//    DL_SYSCTL_resetDevice(DL_SYSCTL_RESET_CAUSE_POR_SW_TRIGGERED);
}

void System::UART::UART::nputs(const char *str, uint32_t n) {
    for(uint32_t i = 0; (i < n) && (str[i] != '\0'); i++){
        DL_UART_transmitDataBlocking(reg, str[i]);
    }
}

void System::UART::UART::ngets(char *str, uint32_t n) {
    for(uint32_t i = 0; i < n; i++){
        char c = DL_UART_receiveDataBlocking(reg);

        str[i] = c;

        switch(c){
            case '\0':
            case '\n':
            case '\r':
                if(i == n)
                    str[i] ='\0';
                else
                    str[i+1] ='\0';
                return;

            case '\b':
                i -= 2;
        }

        DL_UART_transmitDataBlocking(reg, c);
    }
}

void System::UART::UART::putu32d(uint32_t v) {
    if(v == 0){
        DL_UART_transmitDataBlocking(reg, '0');
        return;
    }

    char str[10];
    int i;
    for(i = 0; v > 0; i++){
        str[i] = '0' + (v % 10);
        v /= 10;
    }
    i--;
    for(; i >= 0; i--){
        DL_UART_transmitDataBlocking(reg, str[i]);
    }
}

void System::UART::UART::putu32h(uint32_t v) {
    int started = 0;

    int i;
    DL_UART_transmitDataBlocking(reg, '0');
    DL_UART_transmitDataBlocking(reg, 'x');
    for (i = 28; i >= 0; i -= 4) {
        uint8_t B = (v >> i) & 0xF;

        if (B != 0 || started || i == 0) {
            started = 1;
            if (B < 10)
                DL_UART_transmitDataBlocking(reg, '0' + B);
            else
                DL_UART_transmitDataBlocking(reg, 'A' + (B - 10));
        }
    }
}

void System::SPI::SPI::setSCLKTarget(uint32_t target, uint32_t clk){
    uint32_t t = clk / target;
    if(clk - t * target)
        t++;
    DL_SPI_setBitRateSerialClockDivider(reg, t+1); // eh
}

void System::SPI::SPI::_irq() {
    DL_SPI_IIDX intr = DL_SPI_getPendingInterrupt(reg);
    switch(intr){
        case DL_SPI_IIDX::DL_SPI_IIDX_IDLE:
        case DL_SPI_IIDX::DL_SPI_IIDX_RX:
            while(!DL_SPI_isRXFIFOEmpty(reg)){
                if(_trxBuffer.rx_i < _trxBuffer.len){
                    if(_trxBuffer.rx)
                        _trxBuffer.rx[_trxBuffer.rx_i] = DL_SPI_receiveData8(reg);
                    else
                        DL_SPI_receiveData8(reg);
                    _trxBuffer.rx_i++;
                } else {
                    // ignore and flush
                    DL_SPI_receiveData8(reg);
                }
            }

            if(_trxBuffer.cs && !DL_SPI_isBusy(reg) && (
                    (!_trxBuffer.tx || (_trxBuffer.tx_i >= _trxBuffer.len))
                &&  (!_trxBuffer.rx || (_trxBuffer.rx_i >= _trxBuffer.len))
              )) {
                _trxBuffer.cs->clear();
                _trxBuffer.cs = NULL;
            }

            break;

            // transmit more stuff
        case DL_SPI_IIDX::DL_SPI_IIDX_TX:
            if(_trxBuffer.tx_i < _trxBuffer.len){ // anything left to TX?
                if(_trxBuffer.tx) { // TX array contents
                    _trxBuffer.tx_i +=  DL_SPI_fillTXFIFO8(
                            reg,
                            (uint8_t *)_trxBuffer.tx,
                            _trxBuffer.len - _trxBuffer.tx_i
                        );
                } else { // TX bogus data
                    for(; (_trxBuffer.tx_i < _trxBuffer.len) && !DL_SPI_isTXFIFOFull(reg); _trxBuffer.tx_i++){
                        DL_SPI_transmitData8(reg, TRANSFER_FILLER_BYTE);
                    }
                }
            }

            break;

        default:
            break;

