Gregification/BeeMS/VT_MSPM0G3507_A/src/Core/system.cpp
        return false;
    }

    DL_I2C_flushControllerTXFIFO(reg);
    _trxBuffer.host_task = NULL;
    _trxBuffer.data_length = 0;
    releaseResource();

    return true;
}

bool System::I2C::I2C::rx_blocking(uint8_t addr, void * data, uint8_t size, TickType_t timeout) {
    TickType_t stopTime = xTaskGetTickCount() + timeout;
    if(!takeResource(timeout))
        return false;

    bool ret = false;
    do{
        _trxBuffer.host_task = xTaskGetCurrentTaskHandle();
        _trxBuffer.data      = (uint8_t *)data;
        _trxBuffer.data_length = size;
        _trxBuffer.nxt_index = 0;

        while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE)) {
            vTaskDelay(0);
            if(xTaskGetTickCount() > stopTime){
                break;
            }
        }

        DL_I2C_flushControllerTXFIFO(reg);

        DL_I2C_startControllerTransfer(
                reg,
                addr,
                DL_I2C_CONTROLLER_DIRECTION::DL_I2C_CONTROLLER_DIRECTION_RX,
                _trxBuffer.data_length
            );

        if(0 == ulTaskNotifyTakeIndexed(TASK_NOTIFICATION_ARRAY_INDEX_FOR_SYSTEM_I2C_IRQ, pdTRUE, stopTime - xTaskGetTickCount())){
            break;
        }

        if(_trxBuffer.nxt_index != _trxBuffer.data_length)
            break;

        ret = true;
    }while(false);

    // clean up
    DL_I2C_flushControllerTXFIFO(reg);
    _trxBuffer.host_task = NULL;
    _trxBuffer.data_length = 0;
    releaseResource();

    return ret;
}


/*--- Peripheral IRQ assignment --------------------------------------------------------*/
/* most peripherals don't need a IRQ
 */

#ifdef PROJECT_ENABLE_I2C0
    extern "C" void I2C0_IRQHandler(void){ System::i2c0._irq(); }
#endif
#ifdef PROJECT_ENABLE_I2C1
    extern "C" void I2C1_IRQHandler(void){ System::i2c1._irq(); }
#endif
#ifdef PROJECT_ENABLE_SPI0
    extern "C" void SPI0_IRQHandler(void){ System::spi0._irq(); }
#endif
#ifdef PROJECT_ENABLE_SPI1
    extern "C" void SPI1_IRQHandler(void){ System::spi1._irq(); }
#endif


    // for ease of debugging. delete if needed
    /*
    extern "C" void NMI_Handler(void)
    { while(1){} }
    extern "C" void HardFault_Handler(void) // if this is giving u a problem check if your using IRQ safe funcitons in your IRQ
    { while(1){} }
    extern "C" void GROUP0_IRQHandler(void)
    { while(1){} }
    extern "C" void GROUP1_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG8_IRQHandler(void)
    { while(1){} }
    extern "C" void UART3_IRQHandler(void)
    { while(1){} }
    extern "C" void ADC0_IRQHandler(void)
    { while(1){} }
    extern "C" void ADC1_IRQHandler(void)
    { while(1){} }
    extern "C" void CANFD0_IRQHandler(void)
    { while(1){} }
    extern "C" void DAC0_IRQHandler(void)
    { while(1){} }
    extern "C" void UART1_IRQHandler(void)
    { while(1){} }
    extern "C" void UART2_IRQHandler(void)
    { while(1){} }
    extern "C" void UART0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG6_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMA0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMA1_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG7_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG12_IRQHandler(void)
    { while(1){} }
    extern "C" void I2C0_IRQHandler(void)
    { while(1){} }
    extern "C" void AES_IRQHandler(void)
    { while(1){} }
    extern "C" void RTC_IRQHandler(void)
    { while(1){} }
    extern "C" void DMA_IRQHandler(void)
    { while(1){} }
    */

/*--- idiot detection ------------------------------------------------------------------*/

#if !defined(PROJECT_ENABLE_UART0)
    #error "uart0 should always be enabled and used for the UI. better be a good reason otherwise."
    /* uart0 is used by the LP */
#endif

// i fear for the day this happens
static_assert(pdTRUE == true,
        "pdTRUE != true . the FreeRTOS definition of \"true\" is not the same value as c/c++s \
        definition. code probably wont work. maybe FreeRTOS files were edited. consider reinstall."
    );
static_assert(pdFALSE == false,
        "pdFALSE != false . the FreeRTOS definition of \"false\" is not the same value as c/c++s \
        definition. code probably wont work. maybe FreeRTOS files were edited. consider reinstall."
    );

#ifdef MSPM0G3507_LQFP64
    #define MSPM0G3507_FOOTPRINT_C0 1
#else
    #define MSPM0G3507_FOOTPRINT_C0 0
#endif
#ifdef MSPM0G3507_LQFP48
    #define MSPM0G3507_FOOTPRINT_C1 1
#else
    #define MSPM0G3507_FOOTPRINT_C1 0
#endif
#ifdef MSPM0G3507_VQFN48
    #define MSPM0G3507_FOOTPRINT_C2 1
#else
    #define MSPM0G3507_FOOTPRINT_C2 0
#endif
#ifdef MSPM0G3507_VQFN32
    #define MSPM0G3507_FOOTPRINT_C3 1
#else
    #define MSPM0G3507_FOOTPRINT_C3 0
#endif
#ifdef MSPM0G3507_VSSOP28
    #define MSPM0G3507_FOOTPRINT_C4 1
#else
    #define MSPM0G3507_FOOTPRINT_C4 0
#endif
// Total number of footprints selected
#define MSPM0G3507_FOOTPRINT_TOTAL ( \
    MSPM0G3507_FOOTPRINT_C0 + \
    MSPM0G3507_FOOTPRINT_C1 + \
    MSPM0G3507_FOOTPRINT_C2 + \
    MSPM0G3507_FOOTPRINT_C3 + \
    MSPM0G3507_FOOTPRINT_C4 )
#if MSPM0G3507_FOOTPRINT_TOTAL == 0
    #error "No MSPM0G3507 variant defined. Must define exactly one."
#elif MSPM0G3507_FOOTPRINT_TOTAL > 1
    #error "Multiple MSPM0G3507 variants defined. Can only define one."
    // macros are at top of the header file
#endif
